RAN_1D/channelFlow395K_EPSLS/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
180
(
(0.5 0.00133491 0.5)
(0.5 0.00405446 0.5)
(0.5 0.00687533 0.5)
(0.5 0.00980129 0.5)
(0.5 0.0128363 0.5)
(0.5 0.0159843 0.5)
(0.5 0.0192496 0.5)
(0.5 0.0226366 0.5)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottom
    {
        type            calculated;
        value           uniform (0.5 0 0.5);
    }
    top
    {
        type            calculated;
        value           uniform (0.5 2 0.5);
    }
    front
    {
        type            cyclic;
    }
    Back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
