RAN_1D/channelFlow395K_EPSLS/0/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
180
(
(0.169733 -1390.65 -0 0.169733 -0 0.169733)
(0.169733 -0 -0 0.169733 -0 0.169733)
(0.169733 -0 -0 0.169733 -0 0.169733)
(0.169733 -0 -0 0.169733 -0 0.169733)
(0.169733 -0 -0 0.169733 -0 0.169733)
(0.169733 -0 -0 0.169733 -0 0.169733)
(0.169733 -0 -0 0.169733 -0 0.169733)
(0.169733 -0 -0 0.169733 -0 0.169733)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (6.66667e-13 -0 -0 6.66667e-13 -0 6.66667e-13);
    }
    top
    {
        type            fixedValue;
        value           uniform (6.66667e-13 0 -0 6.66667e-13 -0 6.66667e-13);
    }
    front
    {
        type            cyclic;
    }
    Back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
