RAN_1D/channelFlow395K_EPSLS/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.2546; // I=2/100, U=20.6, k=3/2(U.I)^2;
boundaryField
{

 inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

     front
     {
         type            cyclic;
     }
     Back
     {
          type           cyclic;
     }

    top
    {   
        type            fixedValue;
        value           uniform 1e-12;
        //type            kqRWallFunction;
        //value           $internalField;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 1e-12;
        //type            kqRWallFunction;
        //value           $internalField;
    }
}


// ************************************************************************* //
