RAN_1D/channelFlow395K_EPSLS/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

     front
     {
         type            cyclic;
     }
     Back
     {
          type           cyclic;
     }

    top
    {
       //type		calculated;
	//type 		nutLowReWallFunction;
       type		fixedValue;
       //Cmu		0.09;
       //kappa		0.41;
       //E		9.8;
       value		uniform 0;
    }

    bottom
    {  //type		calculated;
	//type 		nutLowReWallFunction;
       type		fixedValue;
       //Cmu		0.09;
       //kappa		0.41;
       //E		9.8;
       value		uniform 0;
    }
   

}


// ************************************************************************* //
