RAN_1D/channelFlow395K_EPSLS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {   solver		 smoothSolver;		  
        //solver          GAMG;
	tolerance      1e-06;
	relTol         0.1;
	smoother       GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
	}


    pFinal
    {
        $p;
	tolerance      1e-6;
	relTol         0;
	}

  
  

    "(U|k|epsilon)"
    {
     /*   solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0;
    */  solver          smoothSolver;
	smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
    

    }


}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       ;
}

relaxationFactors
{
    fields
    {
        p               1;
    }
    equations
    {
        U               1;
        k               1;
        epsilon         1;

    }
}


// ************************************************************************* //
